I tried with the following config and was not able to reproduce this error. My config was:

```hcl
terraform {
  required_providers {
    octopusdeploy = {
        source = "OctopusDeployLabs/octopusdeploy"
        version = "0.40.4"
    }
  }
}

provider "octopusdeploy" {
  api_key  = "API-*************"
  address = "https://myinstance.octopus.app/"
  space_id = "Spaces-483"
}

resource "octopusdeploy_artifactory_generic_feed" "example" {
  feed_uri                       = "https://example.jfrog.io"
  password                       = "test-password"
  name                           = "Artifactory"
  username                       = "test-username"
  repository                     = "repo"
  layout_regex                   = "this is regex"
}
```

and was able to apply it without problems:
```
tf apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # octopusdeploy_artifactory_generic_feed.example will be created
  + resource "octopusdeploy_artifactory_generic_feed" "example" {
      + feed_uri                             = "https://example.jfrog.io"
      + id                                   = (known after apply)
      + layout_regex                         = "this is regex"
      + name                                 = "Artifactory"
      + package_acquisition_location_options = (known after apply)
      + password                             = (sensitive value)
      + repository                           = "repo"
      + space_id                             = (known after apply)
      + username                             = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

octopusdeploy_artifactory_generic_feed.example: Creating...
octopusdeploy_artifactory_generic_feed.example: Creation complete after 0s [id=Feeds-1681]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Attempting the same config but with the `layout_regex` argument removed also worked fine for me:

```hcl
terraform {
  required_providers {
    octopusdeploy = {
        source = "OctopusDeployLabs/octopusdeploy"
        version = "0.40.4"
    }
  }
}

provider "octopusdeploy" {
  api_key  = "API-*************"
  address = "https://myinstance.octopus.app/"
  space_id = "Spaces-483"
}

resource "octopusdeploy_artifactory_generic_feed" "example" {
  feed_uri                       = "https://example.jfrog.io"
  password                       = "test-password"
  name                           = "Artifactory"
  username                       = "test-username"
  repository                     = "repo"
}
```

```
tf apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # octopusdeploy_artifactory_generic_feed.example will be created
  + resource "octopusdeploy_artifactory_generic_feed" "example" {
      + feed_uri                             = "https://example.jfrog.io"
      + id                                   = (known after apply)
      + name                                 = "Artifactory"
      + package_acquisition_location_options = (known after apply)
      + password                             = (sensitive value)
      + repository                           = "repo"
      + space_id                             = (known after apply)
      + username                             = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

octopusdeploy_artifactory_generic_feed.example: Creating...
octopusdeploy_artifactory_generic_feed.example: Creation complete after 0s [id=Feeds-1682]
```